anseki.vscode-color
arcticicestudio.nord-visual-studio-code
CoenraadS.bracket-pair-colorizer-2
dendron.dendron
dendron.dendron-markdown-preview-enhanced
dendron.dendron-snippet-maker
foxundermoon.shell-format
GitHub.github-vscode-theme
usernamehw.indent-one-space
Yummygum.city-lights-icon-vsc
